BenchmarkOutput/reads_byzantine100/bft_normal.txt
[OVERALL], RunTime(ms), 2713
[OVERALL], Throughput(ops/sec), 368.59565057132323
[TOTAL_GCS_PS_Scavenge], Count, 11
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 59
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 2.174714338370807
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 11
[TOTAL_GC_TIME], Time(ms), 59
[TOTAL_GC_TIME_%], Time(%), 2.174714338370807
[READ], Operations, 1000
[READ], AverageLatency(us), 2543.947
[READ], MinLatency(us), 1533
[READ], MaxLatency(us), 304639
[READ], 25thPercentileLatency(us), 1885
[READ], 50thPercentileLatency(us), 2047
[READ], 75thPercentileLatency(us), 2259
[READ], 90thPercentileLatency(us), 2923
[READ], 95thPercentileLatency(us), 3271
[READ], 99thPercentileLatency(us), 6191
[READ], Return=OK, 1000
[READ], 1533, 1.0
[READ], 1562, 1.0
[READ], 1581, 2.0
[READ], 1606, 1.0
[READ], 1612, 1.0
[READ], 1616, 1.0
[READ], 1618, 2.0
[READ], 1624, 1.0
[READ], 1625, 1.0
[READ], 1628, 1.0
[READ], 1631, 2.0
[READ], 1635, 1.0
[READ], 1636, 2.0
[READ], 1637, 1.0
[READ], 1638, 1.0
[READ], 1640, 1.0
[READ], 1643, 2.0
[READ], 1645, 1.0
[READ], 1647, 1.0
[READ], 1649, 1.0
[READ], 1660, 1.0
[READ], 1661, 2.0
[READ], 1666, 1.0
[READ], 1668, 2.0
[READ], 1669, 1.0
[READ], 1671, 1.0
[READ], 1674, 1.0
[READ], 1675, 1.0
[READ], 1676, 2.0
[READ], 1678, 1.0
[READ], 1679, 1.0
[READ], 1683, 2.0
[READ], 1685, 2.0
[READ], 1687, 1.0
[READ], 1689, 1.0
[READ], 1692, 1.0
[READ], 1694, 1.0
[READ], 1696, 2.0
[READ], 1699, 2.0
[READ], 1706, 1.0
[READ], 1708, 1.0
[READ], 1711, 2.0
[READ], 1712, 1.0
[READ], 1713, 1.0
[READ], 1714, 1.0
[READ], 1717, 2.0
[READ], 1720, 1.0
[READ], 1721, 1.0
[READ], 1722, 1.0
[READ], 1723, 2.0
[READ], 1725, 2.0
[READ], 1727, 2.0
[READ], 1728, 1.0
[READ], 1730, 2.0
[READ], 1731, 1.0
[READ], 1733, 1.0
[READ], 1736, 1.0
[READ], 1737, 1.0
[READ], 1738, 1.0
[READ], 1740, 1.0
[READ], 1742, 3.0
[READ], 1744, 3.0
[READ], 1745, 1.0
[READ], 1746, 1.0
[READ], 1747, 1.0
[READ], 1749, 3.0
[READ], 1750, 2.0
[READ], 1751, 1.0
[READ], 1752, 2.0
[READ], 1753, 1.0
[READ], 1756, 1.0
[READ], 1757, 2.0
[READ], 1758, 1.0
[READ], 1759, 1.0
[READ], 1761, 2.0
[READ], 1763, 1.0
[READ], 1764, 1.0
[READ], 1766, 1.0
[READ], 1767, 2.0
[READ], 1768, 1.0
[READ], 1773, 1.0
[READ], 1775, 4.0
[READ], 1776, 2.0
[READ], 1777, 2.0
[READ], 1778, 4.0
[READ], 1780, 1.0
[READ], 1782, 1.0
[READ], 1784, 1.0
[READ], 1789, 2.0
[READ], 1790, 1.0
[READ], 1791, 2.0
[READ], 1793, 1.0
[READ], 1794, 5.0
[READ], 1795, 1.0
[READ], 1799, 1.0
[READ], 1800, 1.0
[READ], 1801, 2.0
[READ], 1803, 2.0
[READ], 1804, 2.0
[READ], 1805, 2.0
[READ], 1806, 2.0
[READ], 1807, 2.0
[READ], 1808, 2.0
[READ], 1810, 2.0
[READ], 1813, 1.0
[READ], 1814, 1.0
[READ], 1815, 1.0
[READ], 1816, 1.0
[READ], 1817, 1.0
[READ], 1818, 1.0
[READ], 1819, 2.0
[READ], 1820, 1.0
[READ], 1821, 3.0
[READ], 1823, 1.0
[READ], 1824, 1.0
[READ], 1825, 2.0
[READ], 1826, 1.0
[READ], 1828, 3.0
[READ], 1829, 1.0
[READ], 1830, 3.0
[READ], 1832, 1.0
[READ], 1833, 1.0
[READ], 1834, 2.0
[READ], 1835, 3.0
[READ], 1836, 1.0
[READ], 1837, 1.0
[READ], 1838, 1.0
[READ], 1839, 3.0
[READ], 1840, 1.0
[READ], 1842, 1.0
[READ], 1843, 1.0
[READ], 1844, 2.0
[READ], 1845, 2.0
[READ], 1846, 2.0
[READ], 1847, 1.0
[READ], 1848, 1.0
[READ], 1849, 1.0
[READ], 1851, 2.0
[READ], 1852, 2.0
[READ], 1853, 3.0
[READ], 1854, 2.0
[READ], 1856, 1.0
[READ], 1858, 2.0
[READ], 1859, 1.0
[READ], 1860, 2.0
[READ], 1861, 3.0
[READ], 1862, 3.0
[READ], 1863, 2.0
[READ], 1864, 3.0
[READ], 1865, 2.0
[READ], 1867, 2.0
[READ], 1869, 2.0
[READ], 1872, 1.0
[READ], 1873, 1.0
[READ], 1874, 3.0
[READ], 1877, 1.0
[READ], 1878, 1.0
[READ], 1879, 1.0
[READ], 1881, 1.0
[READ], 1883, 2.0
[READ], 1884, 1.0
[READ], 1885, 2.0
[READ], 1887, 1.0
[READ], 1888, 2.0
[READ], 1889, 2.0
[READ], 1890, 2.0
[READ], 1891, 1.0
[READ], 1893, 3.0
[READ], 1895, 2.0
[READ], 1896, 1.0
[READ], 1897, 1.0
[READ], 1898, 1.0
[READ], 1899, 3.0
[READ], 1901, 2.0
[READ], 1902, 3.0
[READ], 1903, 2.0
[READ], 1904, 1.0
[READ], 1907, 2.0
[READ], 1908, 4.0
[READ], 1909, 1.0
[READ], 1910, 2.0
[READ], 1911, 2.0
[READ], 1912, 1.0
[READ], 1913, 1.0
[READ], 1914, 1.0
[READ], 1915, 1.0
[READ], 1916, 1.0
[READ], 1917, 3.0
[READ], 1918, 2.0
[READ], 1920, 1.0
[READ], 1921, 1.0
[READ], 1923, 1.0
[READ], 1924, 1.0
[READ], 1925, 2.0
[READ], 1927, 2.0
[READ], 1928, 3.0
[READ], 1929, 1.0
[READ], 1930, 2.0
[READ], 1931, 3.0
[READ], 1932, 1.0
[READ], 1933, 4.0
[READ], 1934, 3.0
[READ], 1935, 2.0
[READ], 1936, 2.0
[READ], 1937, 3.0
[READ], 1938, 3.0
[READ], 1940, 1.0
[READ], 1941, 1.0
[READ], 1942, 3.0
[READ], 1943, 2.0
[READ], 1944, 1.0
[READ], 1945, 3.0
[READ], 1946, 1.0
[READ], 1947, 3.0
[READ], 1949, 2.0
[READ], 1951, 1.0
[READ], 1952, 1.0
[READ], 1953, 4.0
[READ], 1955, 2.0
[READ], 1956, 1.0
[READ], 1957, 4.0
[READ], 1958, 2.0
[READ], 1959, 1.0
[READ], 1960, 2.0
[READ], 1961, 2.0
[READ], 1962, 1.0
[READ], 1963, 3.0
[READ], 1964, 3.0
[READ], 1965, 2.0
[READ], 1966, 5.0
[READ], 1968, 1.0
[READ], 1969, 2.0
[READ], 1970, 3.0
[READ], 1971, 1.0
[READ], 1972, 3.0
[READ], 1973, 1.0
[READ], 1974, 1.0
[READ], 1975, 1.0
[READ], 1978, 1.0
[READ], 1979, 2.0
[READ], 1980, 1.0
[READ], 1981, 1.0
[READ], 1982, 2.0
[READ], 1984, 1.0
[READ], 1985, 3.0
[READ], 1987, 1.0
[READ], 1988, 3.0
[READ], 1990, 1.0
[READ], 1991, 1.0
[READ], 1992, 3.0
[READ], 1993, 4.0
[READ], 1994, 2.0
[READ], 1996, 2.0
[READ], 1997, 2.0
[READ], 1998, 2.0
[READ], 2001, 3.0
[READ], 2002, 2.0
[READ], 2003, 2.0
[READ], 2004, 2.0
[READ], 2005, 2.0
[READ], 2006, 1.0
[READ], 2007, 1.0
[READ], 2008, 2.0
[READ], 2009, 1.0
[READ], 2010, 2.0
[READ], 2011, 2.0
[READ], 2013, 2.0
[READ], 2014, 1.0
[READ], 2015, 1.0
[READ], 2016, 2.0
[READ], 2017, 2.0
[READ], 2019, 1.0
[READ], 2020, 2.0
[READ], 2022, 1.0
[READ], 2023, 4.0
[READ], 2024, 1.0
[READ], 2025, 4.0
[READ], 2027, 2.0
[READ], 2028, 2.0
[READ], 2029, 3.0
[READ], 2030, 2.0
[READ], 2032, 1.0
[READ], 2034, 1.0
[READ], 2035, 1.0
[READ], 2036, 1.0
[READ], 2037, 1.0
[READ], 2038, 2.0
[READ], 2040, 3.0
[READ], 2041, 1.0
[READ], 2043, 1.0
[READ], 2044, 3.0
[READ], 2045, 1.0
[READ], 2046, 4.0
[READ], 2047, 3.0
[READ], 2049, 7.0
[READ], 2051, 1.0
[READ], 2053, 1.0
[READ], 2055, 1.0
[READ], 2057, 5.0
[READ], 2059, 3.0
[READ], 2061, 1.0
[READ], 2063, 6.0
[READ], 2065, 3.0
[READ], 2067, 4.0
[READ], 2069, 1.0
[READ], 2071, 4.0
[READ], 2073, 2.0
[READ], 2075, 4.0
[READ], 2077, 3.0
[READ], 2081, 3.0
[READ], 2083, 3.0
[READ], 2085, 5.0
[READ], 2087, 1.0
[READ], 2089, 5.0
[READ], 2091, 2.0
[READ], 2093, 1.0
[READ], 2095, 7.0
[READ], 2097, 3.0
[READ], 2099, 4.0
[READ], 2101, 2.0
[READ], 2103, 1.0
[READ], 2105, 1.0
[READ], 2107, 1.0
[READ], 2109, 3.0
[READ], 2111, 4.0
[READ], 2113, 5.0
[READ], 2115, 2.0
[READ], 2117, 4.0
[READ], 2123, 4.0
[READ], 2125, 2.0
[READ], 2127, 3.0
[READ], 2129, 1.0
[READ], 2131, 1.0
[READ], 2133, 3.0
[READ], 2135, 2.0
[READ], 2137, 1.0
[READ], 2139, 3.0
[READ], 2141, 1.0
[READ], 2143, 1.0
[READ], 2145, 5.0
[READ], 2147, 5.0
[READ], 2149, 1.0
[READ], 2153, 2.0
[READ], 2155, 3.0
[READ], 2157, 1.0
[READ], 2159, 1.0
[READ], 2161, 3.0
[READ], 2163, 4.0
[READ], 2165, 3.0
[READ], 2167, 4.0
[READ], 2169, 3.0
[READ], 2173, 1.0
[READ], 2175, 3.0
[READ], 2177, 2.0
[READ], 2179, 1.0
[READ], 2181, 2.0
[READ], 2183, 3.0
[READ], 2187, 4.0
[READ], 2189, 5.0
[READ], 2191, 2.0
[READ], 2193, 7.0
[READ], 2197, 1.0
[READ], 2199, 3.0
[READ], 2201, 4.0
[READ], 2203, 1.0
[READ], 2205, 2.0
[READ], 2207, 3.0
[READ], 2209, 1.0
[READ], 2211, 2.0
[READ], 2213, 1.0
[READ], 2215, 1.0
[READ], 2217, 3.0
[READ], 2219, 2.0
[READ], 2221, 1.0
[READ], 2223, 1.0
[READ], 2225, 1.0
[READ], 2227, 1.0
[READ], 2229, 3.0
[READ], 2231, 2.0
[READ], 2233, 1.0
[READ], 2235, 2.0
[READ], 2237, 3.0
[READ], 2239, 1.0
[READ], 2241, 2.0
[READ], 2245, 2.0
[READ], 2247, 2.0
[READ], 2249, 2.0
[READ], 2253, 2.0
[READ], 2255, 2.0
[READ], 2257, 4.0
[READ], 2259, 2.0
[READ], 2263, 2.0
[READ], 2265, 3.0
[READ], 2267, 2.0
[READ], 2273, 1.0
[READ], 2277, 1.0
[READ], 2279, 2.0
[READ], 2281, 1.0
[READ], 2287, 1.0
[READ], 2289, 1.0
[READ], 2293, 2.0
[READ], 2295, 1.0
[READ], 2297, 2.0
[READ], 2301, 2.0
[READ], 2307, 1.0
[READ], 2309, 1.0
[READ], 2311, 3.0
[READ], 2313, 2.0
[READ], 2315, 1.0
[READ], 2317, 1.0
[READ], 2319, 1.0
[READ], 2321, 3.0
[READ], 2323, 1.0
[READ], 2325, 1.0
[READ], 2327, 1.0
[READ], 2329, 2.0
[READ], 2331, 1.0
[READ], 2333, 1.0
[READ], 2335, 1.0
[READ], 2341, 1.0
[READ], 2347, 1.0
[READ], 2349, 2.0
[READ], 2351, 1.0
[READ], 2355, 2.0
[READ], 2357, 1.0
[READ], 2359, 1.0
[READ], 2369, 1.0
[READ], 2371, 2.0
[READ], 2373, 1.0
[READ], 2379, 1.0
[READ], 2381, 1.0
[READ], 2385, 1.0
[READ], 2387, 1.0
[READ], 2393, 1.0
[READ], 2399, 2.0
[READ], 2407, 1.0
[READ], 2409, 1.0
[READ], 2413, 1.0
[READ], 2417, 2.0
[READ], 2425, 1.0
[READ], 2429, 1.0
[READ], 2435, 1.0
[READ], 2437, 1.0
[READ], 2443, 1.0
[READ], 2447, 1.0
[READ], 2455, 1.0
[READ], 2457, 3.0
[READ], 2463, 1.0
[READ], 2479, 1.0
[READ], 2481, 1.0
[READ], 2483, 1.0
[READ], 2489, 1.0
[READ], 2507, 1.0
[READ], 2511, 4.0
[READ], 2515, 1.0
[READ], 2525, 1.0
[READ], 2527, 1.0
[READ], 2539, 2.0
[READ], 2547, 1.0
[READ], 2549, 1.0
[READ], 2555, 1.0
[READ], 2557, 1.0
[READ], 2567, 1.0
[READ], 2569, 1.0
[READ], 2571, 2.0
[READ], 2575, 1.0
[READ], 2577, 1.0
[READ], 2587, 1.0
[READ], 2597, 1.0
[READ], 2605, 1.0
[READ], 2611, 4.0
[READ], 2613, 1.0
[READ], 2623, 1.0
[READ], 2629, 1.0
[READ], 2637, 1.0
[READ], 2643, 1.0
[READ], 2649, 1.0
[READ], 2657, 1.0
[READ], 2659, 1.0
[READ], 2671, 1.0
[READ], 2689, 2.0
[READ], 2699, 1.0
[READ], 2707, 1.0
[READ], 2709, 1.0
[READ], 2727, 1.0
[READ], 2755, 2.0
[READ], 2761, 1.0
[READ], 2767, 1.0
[READ], 2813, 1.0
[READ], 2817, 1.0
[READ], 2821, 1.0
[READ], 2827, 3.0
[READ], 2841, 1.0
[READ], 2847, 2.0
[READ], 2865, 1.0
[READ], 2869, 1.0
[READ], 2877, 1.0
[READ], 2881, 1.0
[READ], 2895, 1.0
[READ], 2899, 1.0
[READ], 2905, 1.0
[READ], 2909, 1.0
[READ], 2911, 1.0
[READ], 2913, 1.0
[READ], 2917, 2.0
[READ], 2923, 1.0
[READ], 2947, 1.0
[READ], 2955, 1.0
[READ], 2963, 1.0
[READ], 2965, 1.0
[READ], 2971, 2.0
[READ], 2973, 1.0
[READ], 2977, 1.0
[READ], 2981, 1.0
[READ], 2995, 1.0
[READ], 2997, 1.0
[READ], 3003, 2.0
[READ], 3005, 1.0
[READ], 3011, 1.0
[READ], 3017, 1.0
[READ], 3021, 3.0
[READ], 3065, 2.0
[READ], 3071, 1.0
[READ], 3085, 1.0
[READ], 3087, 2.0
[READ], 3091, 1.0
[READ], 3101, 1.0
[READ], 3111, 1.0
[READ], 3115, 1.0
[READ], 3119, 2.0
[READ], 3127, 1.0
[READ], 3153, 1.0
[READ], 3173, 1.0
[READ], 3175, 1.0
[READ], 3183, 2.0
[READ], 3193, 1.0
[READ], 3197, 1.0
[READ], 3201, 2.0
[READ], 3203, 1.0
[READ], 3213, 1.0
[READ], 3227, 1.0
[READ], 3233, 1.0
[READ], 3239, 1.0
[READ], 3253, 2.0
[READ], 3259, 1.0
[READ], 3271, 1.0
[READ], 3313, 1.0
[READ], 3325, 1.0
[READ], 3367, 1.0
[READ], 3377, 2.0
[READ], 3399, 1.0
[READ], 3433, 1.0
[READ], 3463, 1.0
[READ], 3467, 1.0
[READ], 3483, 1.0
[READ], 3485, 1.0
[READ], 3491, 1.0
[READ], 3549, 1.0
[READ], 3571, 1.0
[READ], 3587, 1.0
[READ], 3591, 2.0
[READ], 3609, 1.0
[READ], 3643, 1.0
[READ], 3647, 1.0
[READ], 3687, 1.0
[READ], 3689, 1.0
[READ], 3771, 1.0
[READ], 3781, 1.0
[READ], 3807, 1.0
[READ], 3813, 1.0
[READ], 3829, 1.0
[READ], 3873, 1.0
[READ], 4003, 1.0
[READ], 4475, 1.0
[READ], 4535, 1.0
[READ], 4835, 1.0
[READ], 4895, 1.0
[READ], 4995, 1.0
[READ], 5051, 1.0
[READ], 5183, 1.0
[READ], 5311, 1.0
[READ], 5523, 1.0
[READ], 6071, 1.0
[READ], 6191, 1.0
[READ], 6231, 1.0
[READ], 7707, 1.0
[READ], 7963, 1.0
[READ], 8031, 1.0
[READ], 8183, 1.0
[READ], 8399, 1.0
[READ], 9175, 1.0
[READ], 10015, 1.0
[READ], 11303, 1.0
[READ], 304639, 1.0
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 1554.0
[CLEANUP], MinLatency(us), 1554
[CLEANUP], MaxLatency(us), 1554
[CLEANUP], 25thPercentileLatency(us), 1554
[CLEANUP], 50thPercentileLatency(us), 1554
[CLEANUP], 75thPercentileLatency(us), 1554
[CLEANUP], 90thPercentileLatency(us), 1554
[CLEANUP], 95thPercentileLatency(us), 1554
[CLEANUP], 99thPercentileLatency(us), 1554
[CLEANUP], 1554, 1.0